cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
		<register>
			<name>LSR</name>
			<description>Line Status Register. Contains flags for transmit and receive status, including line errors.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-only</access>
			<resetValue>0x60</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RDR</name>
					<description>Receiver Data Ready. LSR[0] is set when the RBR holds an unread character and is cleared when the UART RBR FIFO is empty.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EMPTY_</name>
							<description>RBR is empty.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VALID</name>
							<description>RBR contains valid data.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OE</name>
					<description>Overrun Error. The overrun error condition is set as soon as it occurs. A LSR read clears LSR[1]. LSR[1] is set when UART RSR has a new character assembled and the UART RBR FIFO is full. In this case, the UART RBR FIFO will not be overwritten and the character in the UART RSR will be lost.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE</name>
							<description>Overrun error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE</name>
							<description>Overrun error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PE</name>
					<description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. A LSR read clears LSR[2]. Time of parity error detection is dependent on FCR[0]. Note: A parity error is associated with the character at the top of the UART RBR FIFO.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE</name>
							<description>Parity error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE</name>
							<description>Parity error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FE</name>
					<description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. A LSR read clears LSR[3]. The time of the framing error detection is dependent on FCR0. Upon detection of a framing error, the RX will attempt to re-synchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the UART RBR FIFO.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE</name>
							<description>Framing error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE</name>
							<description>Framing error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BI</name>
					<description>Break Interrupt. When RXD1 is held in the spacing state (all zeros) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXD1 goes to marking state (all ones). A LSR read clears this status bit. The time of break detection is dependent on FCR[0]. Note: The break interrupt is associated with the character at the top of the UART RBR FIFO.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE</name>
							<description>Break interrupt status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE</name>
							<description>Break interrupt status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>THRE</name>
					<description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty UART THR and is cleared on a THR write.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VALID</name>
							<description>THR contains valid data.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EMPTY_</name>
							<description>THR is empty.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TEMT</name>
					<description>Transmitter Empty. TEMT is set when both THR and TSR are empty; TEMT is cleared when either the TSR or the THR contain valid data.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VALID</name>
							<description>THR and/or the TSR contains valid data.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EMPTY_</name>
							<description>THR and the TSR are empty.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXFE</name>
					<description>Error in RX FIFO. LSR[7] is set when a character with a RX error such as framing error, parity error or break interrupt, is loaded into the RBR. This bit is cleared when the LSR register is read and there are no subsequent errors in the UART FIFO.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOERROR</name>
							<description>RBR contains no UART RX errors or FCR[0]=0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ERROR</name>
							<description>UART RBR contains at least one UART RX error.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SCR</name>
			<description>Scratch Pad Register. Eight-bit temporary storage for software.</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>pad</name>
					<description>A readable, writable byte.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ACR</name>
			<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>START</name>
					<description>Start bit. This bit is automatically cleared after auto-baud completion.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STOP</name>
							<description>Auto-baud stop (auto-baud is not running).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>START</name>
							<description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Auto-baud mode select</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MODE_0_</name>
							<description>Mode 0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MODE_1_</name>
							<description>Mode 1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>AUTORESTART</name>
					<description>Restart enable</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_RESTART</name>
							<description>No restart</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESTART_IN_CASE_OF_T</name>
							<description>Restart in case of time-out (counter restarts at next UART Rx falling edge)</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[7:3]</bitRange>
				</field>
				<field>
					<name>ABEOINTCLR</name>
					<description>End of auto-baud interrupt clear (write only accessible)</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOIMPACT</name>
							<description>Writing a 0 has no impact.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR</name>
							<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ABTOINTCLR</name>
					<description>Auto-baud time-out interrupt clear (write only accessible)</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOIMPACT</name>
							<description>Writing a 0 has no impact.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR</name>
							<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FDR</name>
			<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0x10</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIVADDVAL</name>
					<description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the UART baud rate.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>MULVAL</name>
					<description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for UART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TER</name>
			<description>Transmit Enable Register. Turns off UART transmitter for use with software flow control.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0x80</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>TXEN</name>
					<description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RS485CTRL</name>
			<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>
			<addressOffset>0x04C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NMMEN</name>
					<description>NMM enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the UART to set the parity error and generate an interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXDIS</name>
					<description>Receiver enable.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>The receiver is enabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>The receiver is disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>AADEN</name>
					<description>AAD enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Auto Address Detect (AAD) is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Auto Address Detect (AAD) is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SEL</name>
					<description>Select direction control pin</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RTS</name>
							<description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DTR</name>
							<description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DCTRL</name>
					<description>Auto direction control enable.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_AUTO_DIRECTI</name>
							<description>Disable Auto Direction Control.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_AUTO_DIRECTIO</name>
							<description>Enable Auto Direction Control.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OINV</name>
					<description>Polarity control. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RS485ADRMATCH</name>
			<description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.</description>
			<addressOffset>0x050</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ADRMATCH</name>
					<description>Contains the address match value.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RS485DLY</name>
			<description>RS-485/EIA-485 direction control delay.</description>
			<addressOffset>0x054</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DLY</name>
					<description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
