cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
	</registers>
</peripheral>
	<peripheral derivedFrom="CT16B0">
		<name>CT16B1</name>
		<baseAddress>0x40010000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0x1000</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>CT16B1</name>
			<value>17</value>
		</interrupt>
	</peripheral>
	<peripheral>
	<name>CT32B0</name>
	<description>32-bit counter/timer CT32B0/1</description>
	<groupName>CT32B0</groupName>
	<baseAddress>0x40014000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>CT32B0</name>
	<value>18</value>
	</interrupt>
	<registers>
		<register>
			<name>IR</name>
			<description>Interrupt Register (IR). The IR can be written to clear interrupts. The IR can be read to identify which of five possible interrupt sources are pending.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MR0INT</name>
					<description>Interrupt flag for match channel 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MR1INT</name>
					<description>Interrupt flag for match channel 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MR2INT</name>
					<description>Interrupt flag for match channel 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MR3INT</name>
					<description>Interrupt flag for match channel 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CR0INT</name>
					<description>Interrupt flag for capture channel 0 event.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TCR</name>
			<description>Timer Control Register (TCR). The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CEN</name>
					<description>When one, the Timer Counter and Prescale Counter are enabled for counting. When zero, the counters are disabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CRST</name>
					<description>When one, the Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TC</name>
			<description>Timer Counter (TC). The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TC</name>
					<description>Timer counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PR</name>
			<description>Prescale Register (PR). When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PR</name>
					<description>Prescale value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PC</name>
			<description>Prescale Counter (PC). The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PC</name>
					<description>Prescale counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCR</name>
			<description>Match Control Register (MCR). The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MR0I</name>
					<description>Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR0R</name>
					<description>Reset on MR0: the TC will be reset if MR0 matches it.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR0S</name>
					<description>Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1I</name>
					<description>Interrupt on MR1: an interrupt is generated when MR1 matches the value in the TC.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1R</name>
					<description>Reset on MR1: the TC will be reset if MR1 matches it.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1S</name>
					<description>Stop on MR1: the TC and PC will be stopped and TCR[0] will be set to 0 if MR1 matches the TC.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2I</name>
					<description>Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2R</name>
					<description>Reset on MR2: the TC will be reset if MR2 matches it.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2S</name>
					<description>Stop on MR2: the TC and PC will be stopped and TCR[0] will be set to 0 if MR2 matches the TC.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3I</name>
					<description>Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3R</name>
					<description>Reset on MR3: the TC will be reset if MR3 matches it.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3S</name>
					<description>Stop on MR3: the TC and PC will be stopped and TCR[0] will be set to 0 if MR3 matches the TC.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>MR%s</name>
			<description>Match Register. MR can be enabled through the
MCR to reset the TC, stop both the TC and PC, and/or generate an
interrupt every time MR matches the TC.</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MATCH</name>
					<description>Timer counter match value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CCR</name>
			<description>Capture Control Register (CCR). The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAP0RE</name>
					<description>Capture on CT32Bn_CAP0 rising edge: a sequence of 0 then 1 on CT32Bn_CAP0 will cause CR0 to be loaded with the contents of TC.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CAP0FE</name>
					<description>Capture on CT32Bn_CAP0 falling edge: a sequence of 1 then 0 on CT32Bn_CAP0 will cause CR0 to be loaded with the contents of TC.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CAP0I</name>
					<description>Interrupt on CT32Bn_CAP0 event: a CR0 load due to a CT32Bn_CAP0 event will generate an interrupt.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CR0</name>
			<description>Capture Register (CR). CR is loaded with the value of TC when there is an event on the CT32B1_CAP0 input.</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAP</name>
					<description>Timer counter capture value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EMR</name>
			<description>External Match Register (EMR). The EMR controls the match function and the external match pins CT32B0_MAT[3:0].</description>
			<addressOffset>0x03C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EM0</name>
					<description>External Match 0. This bit reflects the state of output CT32Bn_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT32B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EM1</name>
					<description>External Match 1. This bit reflects the state of output CT32Bn_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT32B0_MAT1/CT16B1_MAT1 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EM2</name>
					<description>External Match 2. This bit reflects the state of output CT32Bn_MAT2, whether or not this output is connected to its pin. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output. This bit is driven to the CT32B0_MAT2/CT16B1_MAT2 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EM3</name>
					<description>External Match 3. This bit reflects the state of output CT32Bn_MAT3, whether or not this output is connected to its pin. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output. This bit is driven to the CT32B0_MAT3/CT16B1_MAT3 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EMC0</name>
					<description>External Match Control 0. Determines the functionality of External Match 0.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC1</name>
					<description>External Match Control 1. Determines the functionality of External Match 1.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC2</name>
					<description>External Match Control 2. Determines the functionality of External Match 2.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC3</name>
					<description>External Match Control 3. Determines the functionality of External Match 3.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
