cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
		<register>
			<name>PIO0_8</name>
			<description>I/O configuration for pin PIO0_8/MISO0/CT16B0_MAT0</description>
			<addressOffset>0x060</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO0_8</name>
							<description>Selects function PIO0_8.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_MISO0</name>
							<description>Selects function MISO0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT16B0_MAT0</name>
							<description>Selects function CT16B0_MAT0.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIO0_9</name>
			<description>I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1</description>
			<addressOffset>0x064</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO0_9</name>
							<description>Selects function PIO0_9.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_MOSI0</name>
							<description>Selects function MOSI0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT16B0_MAT1</name>
							<description>Selects function CT16B0_MAT1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SWCLK_PIO0_10</name>
			<description>I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2</description>
			<addressOffset>0x068</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_SWCLK</name>
							<description>Selects function SWCLK.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO0_10</name>
							<description>Selects function PIO0_10.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_SCK0</name>
							<description>Selects function SCK0 (only if pin SWCLK/PIO0_10/SCK0/CT16B0_MAT2 selected in Table 147).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT16B0_MAT2</name>
							<description>Selects function CT16B0_MAT2.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIO1_10</name>
			<description>I/O configuration for pin PIO1_10/AD6/CT16B1_MAT1/ MISO1</description>
			<addressOffset>0x06C</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO1_10</name>
							<description>Selects function PIO1_10.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_AD6</name>
							<description>Selects function AD6.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT16B1_MAT1</name>
							<description>Selects function CT16B1_MAT1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ADMODE</name>
					<description>Selects Analog/Digital mode</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ANALOG_INPUT_MODE</name>
							<description>Analog input mode</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIGITAL_FUNCTIONAL_M</name>
							<description>Digital functional mode</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:8]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R_PIO0_11</name>
			<description>I/O configuration for pin R/PIO0_11/AD0/CT32B0_MAT3</description>
			<addressOffset>0x074</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_R_</name>
							<description>Selects function R. This function is reserved. Select one of the alternate functions below.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO0_11</name>
							<description>Selects function PIO0_11.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_AD0</name>
							<description>Selects function AD0.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT32B0_MAT3</name>
							<description>Selects function CT32B0_MAT3.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ADMODE</name>
					<description>Selects Analog/Digital mode</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ANALOG_INPUT_MODE</name>
							<description>Analog input mode</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIGITAL_FUNCTIONAL_M</name>
							<description>Digital functional mode</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:8]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R_PIO1_0</name>
			<description>I/O configuration for pin R/PIO1_0/AD1/CT32B1_CAP0</description>
			<addressOffset>0x078</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_R_</name>
							<description>Selects function R. This function is reserved. Select one of the alternate functions below.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO1_0</name>
							<description>Selects function PIO1_0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_AD1</name>
							<description>Selects function AD1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT32B1_CAP0</name>
							<description>Selects function CT32B1_CAP0.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ADMODE</name>
					<description>Selects Analog/Digital mode</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ANALOG_INPUT_MODE</name>
							<description>Analog input mode</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIGITAL_FUNCTIONAL_M</name>
							<description>Digital functional mode</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:8]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
