cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
		<register>
			<name>PIO1_5</name>
			<description>I/O configuration for pin PIO1_5/RTS/CT32B0_CAP0</description>
			<addressOffset>0x0A0</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO1_5</name>
							<description>Selects function PIO1_5.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_RTS</name>
							<description>Selects function RTS.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT32B0_CAP0</name>
							<description>Selects function CT32B0_CAP0.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIO1_6</name>
			<description>I/O configuration for pin PIO1_6/RXD/CT32B0_MAT0</description>
			<addressOffset>0x0A4</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO1_6</name>
							<description>Selects function PIO1_6.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_RXD</name>
							<description>Selects function RXD. Also select the RXD location in the RXD_LOC register.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT32B0_MAT0</name>
							<description>Selects function CT32B0_MAT0.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIO1_7</name>
			<description>I/O configuration for pin PIO1_7/TXD/CT32B0_MAT1</description>
			<addressOffset>0x0A8</addressOffset>
			<access>read-write</access>
			<resetValue>0xD0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function. All other values are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO1_7</name>
							<description>Selects function PIO1_7.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_TXD</name>
							<description>Selects function TXD.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_FUNCTION_CT32B0_MAT1</name>
							<description>Selects function CT32B0_MAT1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE_</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[9:6]</bitRange>
				</field>
				<field>
					<name>OD</name>
					<description>Selects pseudo open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_GPIO_OUTPUT</name>
							<description>Standard GPIO output</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_OUTPUT</name>
							<description>Open-drain output</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SCK0_LOC</name>
			<description>SCK0 pin location select register</description>
			<addressOffset>0x0B0</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCKLOC</name>
					<description>Selects pin location for SCK0 function.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_SCK0_FUNCTIO</name>
							<description>Selects SCK0 function in pin location SWCLK/PIO0_10/SCK0/CT16B0_MAT2 (see Table 129).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SCK0_FUNCTIO</name>
							<description>Selects SCK0 function in pin location PIO2_11/SCK0 (see Table 131).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SCK0_FUNCTIO</name>
							<description>Selects SCK0 function in pin location PIO0_6/SCK0 (see Table 122).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXD_LOC</name>
			<description>RXD pin location select register</description>
			<addressOffset>0x0D4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXDLOC</name>
					<description>Selects pin location for the RXD function.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_RXD_FUNCTION</name>
							<description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118).</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
