cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
	</registers>
</peripheral>
<peripheral>
	<name>SYSCON</name>
	<description>System configuration (SYSCON) </description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>BOD</name>
	<value>26</value>
	</interrupt>
	<interrupt>
	<name>PIO0_0</name>
	<value>0</value>
	</interrupt>
	<interrupt>
	<name>PIO0_1</name>
	<value>1</value>
	</interrupt>
	<interrupt>
	<name>PIO0_2</name>
	<value>2</value>
	</interrupt>
	<interrupt>
	<name>PIO0_3</name>
	<value>3</value>
	</interrupt>
	<interrupt>
	<name>PIO0_4</name>
	<value>4</value>
	</interrupt>
	<interrupt>
	<name>PIO0_5</name>
	<value>5</value>
	</interrupt>
	<interrupt>
	<name>PIO0_6</name>
	<value>6</value>
	</interrupt>
	<interrupt>
	<name>PIO0_7</name>
	<value>7</value>
	</interrupt>
	<interrupt>
	<name>PIO0_8</name>
	<value>8</value>
	</interrupt>
	<interrupt>
	<name>PIO0_9</name>
	<value>9</value>
	</interrupt>
	<interrupt>
	<name>PIO0_10</name>
	<value>10</value>
	</interrupt>
	<interrupt>
	<name>PIO0_11</name>
	<value>11</value>
	</interrupt>
	<interrupt>
	<name>PIO1_0</name>
	<value>12</value>
	</interrupt>
	<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x002</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>System memory remap</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BOOT_LOADER_MODE_IN</name>
							<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_RAM_MODE_INTER</name>
							<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_FLASH_MODE_INT</name>
							<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PRESETCTRL</name>
			<description>Peripheral reset control</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP0_RST_N</name>
					<description>SPI0 reset control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_SPI0_PERI</name>
							<description>Resets the SPI0 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SPI0_RESET_DE_ASSERT</name>
							<description>SPI0 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C_RST_N</name>
					<description>I2C reset control</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_I2C_PERIP</name>
							<description>Resets the I2C peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2C_RESET_DE_ASSERTE</name>
							<description>I2C reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLCTRL</name>
			<description>System PLL control</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSEL</name>
					<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>PSEL</name>
					<description>Post divider ratio P. The division ratio is 2 x P.</description>
					<bitRange>[6:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>P_EQ_1</name>
							<description>P = 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_2</name>
							<description>P = 2</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_4</name>
							<description>P = 4</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_8</name>
							<description>P = 8</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write ones to reserved bits.</description>
					<bitRange>[31:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLSTAT</name>
			<description>System PLL status</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-only</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LOCK</name>
					<description>PLL lock status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PLL_NOT_LOCKED</name>
							<description>PLL not locked</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL_LOCKED</name>
							<description>PLL locked</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSOSCCTRL</name>
			<description>System oscillator control</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BYPASS</name>
					<description>Bypass system oscillator</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>OSCILLATOR</name>
							<description>Oscillator is not bypassed.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BYPASS_ENABLED</name>
							<description>Bypass enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FREQRANGE</name>
					<description>Determines frequency range for Low-power oscillator.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>1 - 20 MHz frequency range.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>15 - 25 MHz frequency range</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>WDTOSCCTRL</name>
			<description>Watchdog oscillator control</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIVSEL</name>
					<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>FREQSEL</name>
					<description>Select watchdog oscillator analog output frequency (Fclkana).</description>
					<bitRange>[8:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>0_6_MHZ</name>
							<description>0.6 MHz</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_05_MHZ</name>
							<description>1.05 MHz</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_4_MHZ</name>
							<description>1.4 MHz</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_75_MHZ</name>
							<description>1.75 MHz</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_1_MHZ</name>
							<description>2.1 MHz</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_4_MHZ</name>
							<description>2.4 MHz</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_7_MHZ</name>
							<description>2.7 MHz</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_0_MHZ</name>
							<description>3.0 MHz</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_25_MHZ</name>
							<description>3.25 MHz</description>
							<value>0x9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_5_MHZ</name>
							<description>3.5 MHz</description>
							<value>0xA</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_75_MHZ</name>
							<description>3.75 MHz</description>
							<value>0xB</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_0_MHZ</name>
							<description>4.0 MHz</description>
							<value>0xC</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_2_MHZ</name>
							<description>4.2 MHz</description>
							<value>0xD</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_4_MHZ</name>
							<description>4.4 MHz</description>
							<value>0xE</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_6_MHZ</name>
							<description>4.6 MHz</description>
							<value>0xF</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IRCCTRL</name>
			<description>IRC control</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0x080</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TRIM</name>
					<description>Trim value</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSRSTSTAT</name>
			<description>System reset status register</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>POR</name>
					<description>POR reset status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_POR_DETECTED_</name>
							<description>No POR detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POR_DETECTED_WRITIN</name>
							<description>POR detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EXTRST</name>
					<description>Status of the external RESET pin.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_RESET_EVENT_DETEC</name>
							<description>No RESET event detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_DETECTED_WRIT</name>
							<description>RESET detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WDT</name>
					<description>Status of the Watchdog reset</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_WDT_RESET_DETECTE</name>
							<description>No WDT reset detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WDT_RESET_DETECTED_</name>
							<description>WDT reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BOD</name>
					<description>Status of the Brown-out detect reset</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_BOD_RESET_DETECTE</name>
							<description>No BOD reset detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOD_RESET_DETECTED_</name>
							<description>BOD reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSRST</name>
					<description>Status of the software system reset</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_SYSTEM_RESET_DETE</name>
							<description>No System reset detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_RESET_DETECTE</name>
							<description>System reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLCLKSEL</name>
			<description>System PLL clock source select</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>System PLL clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLCLKUEN</name>
			<description>System PLL clock source update enable</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA</name>
					<description>Enable system PLL clock source update</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UPDATE_CLOCK_SOURCE</name>
							<description>Update clock source</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAINCLKSEL</name>
			<description>Main clock source select</description>
			<addressOffset>0x070</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>Clock source for main clock</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_CLOCK_PLL</name>
							<description>Input clock to system PLL</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WDT_OSCILLATOR</name>
							<description>WDT oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_CLOCK_OUT</name>
							<description>System PLL clock out</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAINCLKUEN</name>
			<description>Main clock source update enable</description>
			<addressOffset>0x074</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA</name>
					<description>Enable main clock source update</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UPDATE_CLOCK_SOURCE</name>
							<description>Update clock source</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSAHBCLKDIV</name>
			<description>System AHB clock divider</description>
			<addressOffset>0x078</addressOffset>
			<access>read-write</access>
			<resetValue>0x001</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
