cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
		<register>
			<name>SYSAHBCLKCTRL</name>
			<description>System AHB clock control</description>
			<addressOffset>0x080</addressOffset>
			<access>read-write</access>
			<resetValue>0x85F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SYS</name>
					<description>Enables clock for AHB to APB bridge, to the AHB matrix, to the Cortex-M0 FCLK and HCLK, to the SysCon, and to the PMU. This bit is read only.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ROM</name>
					<description>Enables clock for ROM.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RAM</name>
					<description>Enables clock for RAM.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FLASHREG</name>
					<description>Enables clock for flash register interface.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FLASHARRAY</name>
					<description>Enables clock for flash array access.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C</name>
					<description>Enables clock for I2C.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO</name>
					<description>Enables clock for GPIO.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B0</name>
					<description>Enables clock for 16-bit counter/timer 0.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B1</name>
					<description>Enables clock for 16-bit counter/timer 1.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B0</name>
					<description>Enables clock for 32-bit counter/timer 0.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B1</name>
					<description>Enables clock for 32-bit counter/timer 1.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSP0</name>
					<description>Enables clock for SPI0.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UART</name>
					<description>Enables clock for UART. See Section 3.1 for part specific details.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC</name>
					<description>Enables clock for ADC.</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>WDT</name>
					<description>Enables clock for WDT.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IOCON</name>
					<description>Enables clock for I/O configuration block.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SSP0CLKDIV</name>
			<description>SPI0 clock divider</description>
			<addressOffset>0x094</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>SPI0_PCLK clock divider values 0: Disable SPI0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>UARTCLKDIV</name>
			<description>UART clock divder</description>
			<addressOffset>0x098</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>WDTCLKSEL</name>
			<description>WDT clock source select</description>
			<addressOffset>0x0D0</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>WDT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WATCHDOG_OSCILLATOR</name>
							<description>Watchdog oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>WDTCLKUEN</name>
			<description>WDT clock source update enable</description>
			<addressOffset>0x0D4</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA</name>
					<description>Enable WDT clock source update</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UPDATE_CLOCK_SOURCE</name>
							<description>Update clock source</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>WDTCLKDIV</name>
			<description>WDT clock divider</description>
			<addressOffset>0x0D8</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>WDT clock divider values 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTCLKSEL</name>
			<description>CLKOUT clock source select</description>
			<addressOffset>0x0E0</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>CLKOUT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WATCHDOG_OSCILLATOR</name>
							<description>Watchdog oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTUEN</name>
			<description>CLKOUT clock source update enable</description>
			<addressOffset>0x0E4</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA</name>
					<description>Enable CLKOUT clock source update</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UPDATE_CLOCK_SOURCE</name>
							<description>Update clock source</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTCLKDIV</name>
			<description>CLKOUT clock divider</description>
			<addressOffset>0x0E8</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>Clock output divider values 0: Disable CLKOUT.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP0</name>
			<description>POR captured PIO status 0</description>
			<addressOffset>0x100</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CAPPIO0_n</name>
					<description>Raw reset status input PIO0_n: PIO0_11 to PIO0_0</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>CAPPIO1_n</name>
					<description>Raw reset status input PIO1_n: PIO1_11 to PIO1_0</description>
					<bitRange>[23:12]</bitRange>
				</field>
				<field>
					<name>CAPPIO2_n</name>
					<description>Raw reset status input PIO2_n: PIO2_1 to PIO2_0</description>
					<bitRange>[25:24]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP1</name>
			<description>POR captured PIO status 1</description>
			<addressOffset>0x104</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>CAPPIO3_4</name>
					<description>Raw reset status input PIO3_4</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CAPPIO3_5</name>
					<description>Raw reset status input PIO3_5</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>BODCTRL</name>
			<description>BOD control</description>
			<addressOffset>0x150</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BODRSTLEV</name>
					<description>BOD reset level</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_RESET</name>
							<description>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODINTVAL</name>
					<description>BOD interrupt level</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_INT</name>
							<description>Level 0: The interrupt assertion threshold voltage is 1.65 V; the interrupt de-assertion threshold voltage is 1.80 V.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODRSTENA</name>
					<description>BOD reset enable</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_RESET_FUNCTI</name>
							<description>Disable reset function.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_RESET_FUNCTIO</name>
							<description>Enable reset function.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSTCKCAL</name>
			<description>System tick counter calibration</description>
			<addressOffset>0x154</addressOffset>
			<access>read-write</access>
			<resetValue>0x004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAL</name>
					<description>System tick timer calibration value</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NMISRC</name>
			<description>NMI source selection</description>
			<addressOffset>0x174</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRQNO</name>
					<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 in this register is 1. See Table 45 for the list of interrupt sources and their IRQ numbers.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[30:5]</bitRange>
				</field>
				<field>
					<name>NMIEN</name>
					<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
