cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV.svd
		<register>
			<name>STARTAPRP0</name>
			<description>Start logic edge control register 0</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>APRPIO0_0</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>APRPIO0_1</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>APRPIO0_2</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>APRPIO0_3</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>APRPIO0_4</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APRPIO0_5</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>APRPIO0_6</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>APRPIO0_7</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>APRPIO0_8</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>APRPIO0_9</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>APRPIO0_10</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>APRPIO0_11</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>APRPIO1_0</name>
					<description>Edge select for start logic input PIO1_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTERP0</name>
			<description>Start logic signal enable register 0</description>
			<addressOffset>0x204</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ERPIO0_0</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ERPIO0_1</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ERPIO0_2</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ERPIO0_3</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERPIO0_4</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ERPIO0_5</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ERPIO0_6</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ERPIO0_7</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ERPIO0_8</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERPIO0_9</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ERPIO0_10</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ERPIO0_11</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ERPIO1_0</name>
					<description>Enable start signal for start logic input PIO1_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTRSRP0CLR</name>
			<description>Start logic reset register 0</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RSRPIO0_0</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_1</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_2</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_3</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_4</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_5</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_6</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_7</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_8</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_9</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_10</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_11</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RSRPIO1_0</name>
					<description>Start signal reset for start logic input PIO1_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTSRP0</name>
			<description>Start logic status register 0</description>
			<addressOffset>0x20C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SRPIO0_0</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SRPIO0_1</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SRPIO0_2</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SRPIO0_3</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SRPIO0_4</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SRPIO0_5</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SRPIO0_6</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SRPIO0_7</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SRPIO0_8</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SRPIO0_9</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SRPIO0_10</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SRPIO0_11</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SRPIO1_0</name>
					<description>Start signal status for start logic input PIO1_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PDSLEEPCFG</name>
			<description>Power-down states in Deep-sleep mode</description>
			<addressOffset>0x230</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRCOUT_PD</name>
					<description>IRC oscillator output power-down</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IRC_PD</name>
					<description>IRC oscillator power-down</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NOTUSED0</name>
					<description>Reserved. Always write these bits as 1.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>BOD_PD</name>
					<description>BOD power-down control in Deep-sleep mode, see Table 37.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NOTUSED1</name>
					<description>Reserved. Always write these bits as 11.</description>
					<bitRange>[5:4]</bitRange>
				</field>
				<field>
					<name>WDTOSC_PD</name>
					<description>Watchdog oscillator power control in Deep-sleep mode, see Table 37.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NOTUSED2</name>
					<description>Reserved. Always write this bit as 1.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>NOTUSED3</name>
					<description>Reserved. Always write these bits as 000.</description>
					<bitRange>[10:8]</bitRange>
				</field>
				<field>
					<name>NOTUSED4</name>
					<description>Reserved. Always write these bits as 11.</description>
					<bitRange>[12:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PDAWAKECFG</name>
			<description>Power-down states after wake-up from Deep-sleep mode</description>
			<addressOffset>0x234</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000EDF0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRCOUT_PD</name>
					<description>IRC oscillator output wake-up configuration</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IRC_PD</name>
					<description>IRC oscillator power-down wake-up configuration</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FLASH_PD</name>
					<description>Flash wake-up configuration</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BOD_PD</name>
					<description>BOD wake-up configuration</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC_PD</name>
					<description>ADC wake-up configuration</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSOSC_PD</name>
					<description>System oscillator wake-up configuration</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WDTOSC_PD</name>
					<description>Watchdog oscillator wake-up configuration</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSPLL_PD</name>
					<description>System PLL wake-up configuration</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write this bit as 1.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write this bit as 0.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write this bit as 1.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write this bit as 1.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write this bit as 0.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write these bits as 111.</description>
					<bitRange>[15:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
